/*
 * video_mix.h
 *  目前支持1分屏，4分屏，6分屏和8分屏
 *  每个屏的序号如下：
1分屏：                                                                                                               2分屏：
-----------------------------------------        -----------------------------------------
|                                       |        |                  |                    |
|                                       |        |                  |                    |
|                                       |        -----------------------------------------
|                                       |        |                  |                    |
|                                       |        |                  |                    |
|                                       |        |                  |                    |
|                  1                    |        |        1         |         2          |
|                                       |        |                  |                    |
|                                       |        |                  |                    |
|                                       |        -----------------------------------------
|                                       |        |                  |                    |
|                                       |        |                  |                    |
-----------------------------------------        -----------------------------------------

3分屏：
-----------------------------------------
|        |                    |         |
|        |                    |         |
|        |                    |         |
|        |         1          |         |
|        |                    |         |
|        |                    |         |
-----------------------------------------
|                  |                    |
|                  |                    |
|                  |                    |
|        2         |         3          |
|                  |                    |
|                  |                    |
-----------------------------------------


4分屏：                                                                                                                  6分屏：
-----------------------------------------         -----------------------------------------
|                  |                    |         |                           |            |
|                  |                    |         |                           |            |
|                  |                    |         |                           |      2     |
|        1         |         2          |         |                           |            |
|                  |                    |                    1                -------------
|                  |                    |         |                           |            |
-----------------------------------------         |                           |      3     |
|                  |                    |         |                           |            |
|                  |                    |         |                           |            |
|                  |                    |         -----------------------------------------
|        3         |         4          |         |             |             |            |
|                  |                    |         |      4      |       5     |      6     |
|                  |                    |         |             |             |            |
-----------------------------------------         |             |             |            |
                                                  -----------------------------------------


8分屏：                                                                                                                    9分屏：
 -----------------------------------------         -----------------------------------------
 |                            |          |         |             |             |            |
 |                            |     2    |         |             |             |            |
 |                            |          |         |     1       |      2      |      3     |
 |                            |-----------         |             |             |            |
 |                            |          |         -----------------------------------------
 |             1              |     3    |         |             |             |            |
 |                            |          |         |             |             |            |
 |                            |-----------         |     4       |     5       |      6     |
 |                            |          |         |             |             |            |
 |                            |     4    |         -----------------------------------------
 |                            |          |         |             |             |            |
 -----------------------------------------         |      7      |     8       |      9     |
 |        |         |         |          |         |             |             |            |
 |    5   |    6    |    7    |     8    |         |             |             |            |
 |        |         |         |          |         -----------------------------------------
 -----------------------------------------


13分屏：                                                                                                                                                   16分屏：
 -----------------------------------------          -----------------------------------------
 |        |         |         |          |          |        |         |         |          |
 |   1    |    2    |    3    |     4    |          |   1    |    2    |    3    |     4    |
 |        |         |         |          |          |        |         |         |          |
 |--------|-------------------|-----------          |--------|---------|---------|-----------
 |        |                   |          |          |        |         |         |          |
 |   5    |                   |     7    |          |   5    |    6    |    7    |     8    |
 |        |                   |          |          |        |         |         |          |
 |--------|         6         |-----------          |--------|---------|---------|-----------
 |        |                   |          |          |        |         |         |          |
 |   8    |                   |     9    |          |   9    |    10   |   11    |    12    |
 |        |                   |          |          |        |         |         |          |
 -----------------------------------------          ----------------------------------------
 |        |         |         |          |          |        |         |         |          |
 |   10   |    11   |    12   |    13    |          |   13   |    14   |    15   |    16    |
 |        |         |         |          |          |        |         |         |          |
 -----------------------------------------         -----------------------------------------


25分屏：
 ----------------------------------------------------
 |        |         |         |          |          |
 |   1    |    2    |    3    |     4    |     5    |
 |        |         |         |          |          |
 |--------|---------|---------|----------------------
 |        |         |         |          |          |
 |   6    |    7    |     8   |     9    |    10    |
 |        |         |         |          |          |
 |--------|---------|---------|----------------------
 |        |         |         |          |          |
 |  11    |    12   |   13    |    14    |    15    |
 |        |         |         |          |          |
 ---------------------------------------- ----------
 |        |         |         |          |          |
 |   16   |    17   |    18   |    19    |    20    |
 |        |         |         |          |          |
 ----------------------------------------- ----------
 |        |         |         |          |          |
 |   21   |    22   |    23   |    24    |    25    |
 |        |         |         |          |          |
 ---------------------------------------- ----------



 */

#ifndef VIDEO_MIX_H_
#define VIDEO_MIX_H_

#include <stdint.h>
#include "libv_log.h"
#include "libvideo.h"

#ifdef __cplusplus
extern "C" {
#endif

//支持的最大的混屏个数
#define MAX_MIX_SCREEN_COUNT     25

//支持的最大分割数
#define MAX_MIX_SCREEN_TOKEN_COUNT     5


typedef struct __VIDEO_SUB_INFO     //  子屏幕信息
{
    int32_t  width;         //子屏的宽度
    int32_t  height;        //子屏的高度
    int32_t  left_width;         //子屏在大屏中相对于左边的距离
    int32_t  above_height;        //子屏在大屏中相对于上边的距离
    struct SwsContext *sws_ctx_ffm;     //ffm的分辨率转换句柄
    int32_t in_width;           //输入图片的宽度，用于记录sws_ctx_ffm的初始化值
    int32_t in_height;          //输入图片的高度
}VIDEO_SUB_INFO;

typedef struct __VIDEO_MIX_TH
{
    VIDEO_MIX_TYPE mix_type;    //混屏类型
    int32_t  out_width;         //输出的屏的宽度
    int32_t  out_height;        //输出的屏的高度
    PICTURE_FORMAT out_pic_fmt;     //输出的视频的格式：目前仅支持420p
    VIDEO_SUB_INFO sub_screens[MAX_MIX_SCREEN_COUNT];//根据下标确定是哪个屏，下标 == 序号 -1
}VIDEO_MIX_TH;

//建议输出720p
VIDEO_MIX_TH *alloc_video_mix_th(VIDEO_MIX_TYPE mix_type, int32_t out_width, int32_t out_height, PICTURE_FORMAT pic_fmt);
void free_video_mix_th(VIDEO_MIX_TH *pvmth);

//混屏处理函数。in_pics：输入图片列表，下标即其在整个屏幕中的分屏序号，实际上就是FRAME_PIC_DATA *类型数组
//中间可以出现NULL指针，表示这个分屏此次不用加入图像，此时库中不会更改此部分区域的值。如果一路图像帧率过慢，可能会出现同一张图片
//混屏两次的情况，这种情况可以将上次混屏的视频输出数据直接作为下次的输入，然后指定这一路图片指针为NULL，效率会高一些。
//in_count：输入图片格式。out_pic：输出图片
//out_pic中必须有充足的缓冲区，否则会段错误。如果不清楚如何申请，建议调用：libvideo_alloc_frame_pic
//return：0：成功，-1：失败
//目前只支持YUV I420输入，如果不是，请先进行转换。或者对函数进行修改，支持其他格式输入。
//对于空白的部分，库内部不做处理，需要上层应用控制空白部分的底色。全部初始化为127为灰色。
int32_t video_mix_pic(VIDEO_MIX_TH *pvmth, FRAME_PIC_DATA **in_pics, int32_t in_count, FRAME_PIC_DATA *out_pic);
int Reset_video_mix(VIDEO_MIX_TH *pvmth,int num);
//重置mix
int Reset_video_mix(VIDEO_MIX_TH *pvmth,int num);


#ifdef __cplusplus
}
#endif



#endif /* VIDEO_MIX_H_ */

